STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MultiAppAt/STM32_WPAN/App/app_ble_cl.c
/* USER CODE END 0 */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_CL_Init( void )
{
/* USER CODE BEGIN APP_BLE_Init_1 */
  
  index_bd_addr = 0;

/* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
    0,                                  /** BleBufferSize not used */
    CFG_BLE_NUM_GATT_ATTRIBUTES,
    CFG_BLE_NUM_GATT_SERVICES,
    CFG_BLE_ATT_VALUE_ARRAY_SIZE,
    CFG_BLE_NUM_LINK,
    CFG_BLE_DATA_LENGTH_EXTENSION,
    CFG_BLE_PREPARE_WRITE_LIST_SIZE,
    CFG_BLE_MBLOCK_COUNT,
    CFG_BLE_MAX_ATT_MTU,
    CFG_BLE_SLAVE_SCA,
    CFG_BLE_MASTER_SCA,
    CFG_BLE_LSE_SOURCE,
    CFG_BLE_MAX_CONN_EVENT_LENGTH,
    CFG_BLE_HSE_STARTUP_TIME,
    CFG_BLE_VITERBI_MODE,
    CFG_BLE_OPTIONS,
    0,
    CFG_BLE_MAX_COC_INITIATOR_NBR,
    CFG_BLE_MIN_TX_POWER,
    CFG_BLE_MAX_TX_POWER}
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

/**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  SHCI_C2_BLE_Init( &ble_init_cmd_packet );

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CL_GAP_DISCON_ID, UTIL_SEQ_RFU, APP_BLE_CL_GAP_Disconnect);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CL_L2CAP_CONN_UPDATE_RESP_ID, UTIL_SEQ_RFU, BLE_CL_L2CAP_Conn_Update);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONFIRM_PAIRING_ID, UTIL_SEQ_RFU, Confirm_Pairing);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_REQUEST_PAIRING_ID, UTIL_SEQ_RFU, Pairing_Request);

  /**
   * Initialization of the BLE App Context
   */

  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  CL_Connection_Status = APP_BLE_IDLE;
  
  /**
   * Initialize P2P Client Application
   */
  P2PC_APP_Init();

/* USER CODE BEGIN APP_BLE_Init_2 */
  
  /**
   * Send a acknowledgement of the correct initialization of the p2p application
   */
   UART_App_SendData("\r\nCL OK\r\n", 9);

/* USER CODE END APP_BLE_Init_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_CL_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  hci_le_connection_complete_event_rp0 * connection_complete_event;
  evt_blecore_aci *blecore_evt;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;
  
  /* Pairing */
  aci_gap_numeric_comparison_value_event_rp0 *evt_numeric_value;
  aci_gap_pairing_complete_event_rp0 *pairing_complete;
  uint32_t numeric_value;
  char numeric_value_str[20];
  /*****/
  
  uint8_t result;
  uint8_t event_type, event_data_size;
  int k = 0;
  uint8_t adtype, adlength;
  
  int i;
  uint8_t different;

  switch (event_pckt->evt)
  {
    /* USER CODE BEGIN evt */

    /* USER CODE END evt */
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      handleNotificationCL.P2P_Evt_Opcode = PEERC_DISCON_HANDLE_EVT;
      blecore_evt = (evt_blecore_aci*) event_pckt->data;
      /* USER CODE BEGIN HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE END HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
      switch (blecore_evt->ecode)
      {
      /* USER CODE BEGIN ecode */
        case ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE:
//          UTIL_SEQ_SetTask( 1<<CFG_TASK_REQUEST_PAIRING_ID, CFG_SCH_PRIO_0);
          break;
        
      case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE :
            UART_App_SendData("\r\n", 2);
            PairingContext.PairingConfirmRequested = 1;
            evt_numeric_value = (aci_gap_numeric_comparison_value_event_rp0 *)blecore_evt->data;
            numeric_value = evt_numeric_value->Numeric_Value;
            sprintf(numeric_value_str, "%d", (int)numeric_value);
            UART_App_SendData((char *)numeric_value_str, (uint8_t)(strlen(numeric_value_str)));
            UART_App_SendData(":PREQ?\r\n", 8);								
        break;  
        
      case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE :
            pairing_complete = (aci_gap_pairing_complete_event_rp0*)blecore_evt->data;
            if (pairing_complete->Status == 0)
            {
              UART_App_SendData("\r\nP\r\n", 5);
              PairingContext.PairingComplete = 1;
            }
            else UART_App_SendData("\r\nF\r\n", 5);
        break;
      /* USER CODE END ecode */

        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
        /* USER CODE BEGIN ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

        /* USER CODE END ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blecore_evt->data;
          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
              && gap_evt_proc_complete->Status == 0x00)
          {
              /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */
              BSP_LED_Off(LED_BLUE);
              if(!autoconn_status) UART_App_SendData("\r\nOK\r\n", 6);
              /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n");
#endif
            if(autoconn_status)
            {
              /* if the bd address given by the user correspond to the device found, connect to it */
              if (BleApplicationContext.DeviceServerFound == 0x01 && BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
              {
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
              }
              else if(BleApplicationContext.DeviceServerFound == 0x00) UART_App_SendData("\r\nNF\r\n", 6);
              autoconn_status = 0;
            }
          }
        }
        break;
              
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE :
          l2cap_conn_upd_req_event = (aci_l2cap_connection_update_req_event_rp0 *) blecore_evt->data;
          
          UTIL_SEQ_SetTask(1 << CFG_TASK_CL_L2CAP_CONN_UPDATE_RESP_ID, CFG_SCH_PRIO_0);          
          break;
        default:
          /* USER CODE BEGIN ecode_default */

          /* USER CODE END ecode_default */
          break;
       
