STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MultiAppAt/STM32_WPAN/App/app_ble_cl.c
      }
    }
    break; 

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      /* USER CODE BEGIN HCI_DISCONNECTION_COMPLETE_EVT_CODE */

      /* USER CODE END HCI_DISCONNECTION_COMPLETE_EVT_CODE */
      if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          CL_Connection_Status = APP_BLE_IDLE;
          BleApplicationContext.DeviceServerFound = 0x00;
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n");
#endif
          if (disconnection_status == TO_SWITCH_APP) //Disconnection done by application for switching app
          {
            handleNotificationCL.P2P_Evt_Opcode = PEERC_DISCON_SWITCH_HANDLE_EVT;
            handleNotificationCL.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotificationCL);
          }
          else { //Deconnection done by user/client or by order from an AT command
            handleNotificationCL.P2P_Evt_Opcode = PEERC_DISCON_HANDLE_EVT;
            handleNotificationCL.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotificationCL);
          }
        }
     }
     break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      /* USER CODE BEGIN HCI_LE_META_EVT_CODE */

      /* USER CODE END HCI_LE_META_EVT_CODE */
      meta_evt = (evt_le_meta_event*) event_pckt->data;

      switch (meta_evt->subevent)
      {
      /* USER CODE BEGIN subevent */

      /* USER CODE END subevent */
          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
          /* USER CODE BEGIN HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

          /* USER CODE END HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
          /**
           * The connection is done, 
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
          BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          CL_Connection_Status = APP_BLE_CONNECTED_CLIENT;

          /* CONNECTION WITH CLIENT */
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("\r\n\r** CONNECTION EVENT WITH SERVER \n");
#endif
          handleNotificationCL.P2P_Evt_Opcode = PEERC_CONN_HANDLE_EVT;
          handleNotificationCL.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotificationCL);

          result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
          if (result == BLE_STATUS_SUCCESS)
          {
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n");
            APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
#endif
          }
          else
          {
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
#endif
          }

          break; /* HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          uint8_t *adv_report_data;
          /* USER CODE BEGIN HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE */

          /* USER CODE END HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE */
          le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;
          
          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
          k = 0;

          /* search AD TYPE 0x09 (Complete Local Name) */
          /* search AD Type 0x02 (16 bits UUIDS) */
          if (event_type == ADV_IND)
          {

            /*ISOLATION OF BD ADDRESS AND LOCAL NAME*/

            
            while(k < event_data_size)
            {
              adlength = adv_report_data[k];
              adtype = adv_report_data[k + 1];
              switch (adtype)
              {
                case AD_TYPE_FLAGS: /* now get flags */
                /* USER CODE BEGIN AD_TYPE_FLAGS */

                /* USER CODE END AD_TYPE_FLAGS */
                  break;

                case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
                /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

                /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
                break;
                case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufactureur Specific */
                /* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */

                /* USER CODE END AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
                  if (adlength >= 7 && adv_report_data[k + 2] == 0x01)
                  { /* ST VERSION ID 01 */
#if(CFG_DEBUG_APP_TRACE != 0)
                    APP_DBG_MSG("--- ST MANUFACTURER ID --- \n");
#endif
                    switch (adv_report_data[k + 3])
                    {   /* Demo ID */
                      case CFG_DEV_ID_AT_P2P_SERVER: /* (0End Device 1) */
#if(CFG_DEBUG_APP_TRACE != 0)
                        APP_DBG_MSG("-- SERVER DETECTED -- VIA MAN ID\n");
#endif
                        if (autoconn_status)
                        {
                          if (strncmp((char *)(BD_Addr), (char *)(le_advertising_event->Advertising_Report[0].Address), 6) == 0)
                          {
                            BleApplicationContext.DeviceServerFound = 0x01;
                          }
                        }
                        else //autoconn_status == 0
                        {
                          /* Send via UART the 5 first bd addresses found */
                          different = 0; //Variable to check if the currently stored BD Address correspond to the one chosen by the user, if not "different" is incremented
                          
